# Pandas tutorial
    
    Pandas is an open source , BSD-licensed library providing high-performance, easy-to-use data Structures and analysis tools for the python programming language.
    
### Agenda

    * What is Data Frames?
    
    which has more than one row and one column
    
    
    * What is Data Series?
      
  series can either be One Row or one column
      
    * Different operations in Pandas

In [1]:
# Import pandas
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1', 'Row2', 'Row3', 'Row4', 'Row5'], columns=['Column1','Column2', 'Column3','Column4'])

df.head() #head function defines how much rows you wanna show by default it argument is 5. ex:-  df.head(3)

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [11]:
df.to_csv('test1.csv')    # to convert dataFrames to comma Saperated value(CSV) file





## Accessing the elements

#### 1.  .loc, .iloc

In [15]:
df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [16]:
type(df.loc['Row1']) # returns pandas.core.series.Series

pandas.core.series.Series

In [22]:
# iloc[Rows, Columns] using slice


df.iloc[1:4, 2:5]

#type( df.iloc[1:4, 2:5 ])          pandas.core.frame.DataFrame

      Column3  Column4
Row2        6        7
Row3       10       11
Row4       14       15

In [24]:
x = df.iloc[1:4, 0]
type(x) # return pandas.core.series.Series    because we have 0 column

pandas.core.series.Series



# Convert dataFrame into Array

## .values

## .value_counts()

## .isnull().sum()  

retuen how many null values in every column

## .unique()
    return how many quique values are in Column

In [48]:
df[['Column1']]

      Column1
Row1        0
Row2        4
Row3        8
Row4       12
Row5       16

In [42]:
df.values
df.iloc[1:, 2:].values
df.value_counts()

Column1  Column2  Column3  Column4
0        1        2        3          1
4        5        6        7          1
8        9        10       11         1
12       13       14       15         1
16       17       18       19         1
dtype: int64

In [34]:
df.isnull()

df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [37]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])